#+title: SurrealDB Demo

This document is for SurrealDB demo. It is meant to be an introduction to SurrealDB, especially with SurrealQL. There are number of interactions involved in this demo, but it only scratches the surface.

If you want to find more about SurrealQL, you can check out the official document, which provides a lot of details for each statement used, and more complex use cases.
https://surrealdb.com/docs/surrealql

* Start SurrealDB
There are several ways to get SurrealDB up and running, but the following command should do.

#+NAME: surreal-start
#+begin_src bash :async
  surreal start \
          --auth \
          --user root \
          --pass surrealdb \
          memory
#+end_src

This starts the SurrealDB server process on your machine (by default it uses port ~:8000~, which you can change with ~--bind~ flag).

A quick reference of what the command does:
- ~start memory~: Start the SurrealDB server with in-memory storage, only meant for simple use cases
- ~--auth~: Enable authentication -- without this, anonymous users can have the same permissions as root user
- ~--user~: Set the root user username
- ~--pass~: Set the root user password

#+RESULTS: surreal-start
: __

Ensure SurrealDB is running by running the following command

#+NAME: surreal-is-ready
#+begin_src bash
  surreal is-ready --endpoint "http://localhost:8000"
#+end_src

#+RESULTS: surreal-is-ready
: __


* Using SurrealDB Demo Data
SurrealDB has some decently complicated data for demo purposes.
https://surrealdb.com/docs/surrealql/demo

For simplicity sake, I have copied the demo data file over to this repo, [[file:surreal_deal_v1.surql][surreal_deal_v1.surql]].
Let's import it and check out more about SurrealDB and SurrealQL.
#+NAME: surreal-import
#+begin_src bash
  surreal import \
          --endpoint "http://localhost:8000" \
          --user root \
          --pass surrealdb \
          --ns demo_namespace \
          --db demo_database \
          surreal_deal_v1.surql
#+end_src

#+RESULTS: surreal-import
: __

If you want to import from the file without copying this repository, you can run the following command instead.
#+NAME: surreal-import-curl
#+begin_src bash
  {
      curl -sSL -o /tmp/surreal_deal_v1.surql 'https://raw.githubusercontent.com/rytswd/disruptive-tech-london-2023/main/surreal_deal_v1.surql'
      surreal import \
              --endpoint "http://localhost:8000" \
              --user root \
              --pass surrealdb \
              --ns demo_namespace \
              --db demo_database \
              /tmp/surreal_deal_v1.surql
  }
#+end_src

#+RESULTS: surreal-import-curl
: __


